In [56]:
import pandas as pd 
import json 
import yaml
import datetime

In [2]:
with open('yaml_example.yaml') as file:
    data = file.read()

In [3]:
data

'Person:\n    - name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    - name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    - name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    - name: John\n      surname: King\n      role: Admin\n      age: 27\n    - name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    - name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    - name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19'

In [4]:
data_v2 = data.split(':\n    ')

In [5]:
data_v2

['Person',
 '- name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    - name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    - name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    - name: John\n      surname: King\n      role: Admin\n      age: 27\n    - name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    - name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    - name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19']

In [6]:
data_v2[1] = data_v2[1].split('-')

In [7]:
data_v2

['Person',
 ['',
  ' name: Alex\n      surname: Brown\n      role: "Student"\n      age: 20\n    ',
  ' name: Chris\n      surname: Davis\n      role: Instructor\n      age: 31\n    ',
  ' name: Emma\n      surname: Green\n      role: Student\n      age: 22\n    ',
  ' name: John\n      surname: King\n      role: Admin\n      age: 27\n    ',
  ' name: Lucy\n      surname: Miller\n      role: Admin\n      age: 24\n    ',
  ' name: Nick\n      surname: Oliver\n      role: Professor\n      age: 45\n    ',
  ' name: Paul\n      surname: Quinn\n      role: Assistant\n      age: 19']]

In [8]:
people = []
for person in data_v2[1]:
    people.append(person.strip().split('\n      '))

In [9]:
people

[[''],
 ['name: Alex', 'surname: Brown', 'role: "Student"', 'age: 20'],
 ['name: Chris', 'surname: Davis', 'role: Instructor', 'age: 31'],
 ['name: Emma', 'surname: Green', 'role: Student', 'age: 22'],
 ['name: John', 'surname: King', 'role: Admin', 'age: 27'],
 ['name: Lucy', 'surname: Miller', 'role: Admin', 'age: 24'],
 ['name: Nick', 'surname: Oliver', 'role: Professor', 'age: 45'],
 ['name: Paul', 'surname: Quinn', 'role: Assistant', 'age: 19']]

In [10]:
people_list = [] 
for person in people:
    if person != ['']:
        people_dict = {}
        for item in person:
            temp_variable = item.split(': ')
            try:               
                people_dict[temp_variable[0].strip()] = int(temp_variable[1].replace('"', '').strip())
            except:               
                people_dict[temp_variable[0].strip()] = temp_variable[1].replace('"', '').strip()
        people_list.append(people_dict)

In [11]:
people_list

[{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
 {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
 {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
 {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
 {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
 {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
 {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]

In [12]:
person = pd.DataFrame(people_list)

In [13]:
person

    name surname        role  age
0   Alex   Brown     Student   20
1  Chris   Davis  Instructor   31
2   Emma   Green     Student   22
3   John    King       Admin   27
4   Lucy  Miller       Admin   24
5   Nick  Oliver   Professor   45
6   Paul   Quinn   Assistant   19

In [14]:
with open('yaml_example.yaml') as file:
    yaml_data = yaml.safe_load(file)

In [15]:
yaml_data

{'Person': [{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
  {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
  {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
  {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
  {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
  {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
  {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]}

In [16]:
json_data = json.loads(json.dumps(yaml_data))

In [17]:
json_data

{'Person': [{'name': 'Alex', 'surname': 'Brown', 'role': 'Student', 'age': 20},
  {'name': 'Chris', 'surname': 'Davis', 'role': 'Instructor', 'age': 31},
  {'name': 'Emma', 'surname': 'Green', 'role': 'Student', 'age': 22},
  {'name': 'John', 'surname': 'King', 'role': 'Admin', 'age': 27},
  {'name': 'Lucy', 'surname': 'Miller', 'role': 'Admin', 'age': 24},
  {'name': 'Nick', 'surname': 'Oliver', 'role': 'Professor', 'age': 45},
  {'name': 'Paul', 'surname': 'Quinn', 'role': 'Assistant', 'age': 19}]}

In [18]:
new_data = pd.json_normalize(json_data['Person'])

In [19]:
new_data

    name surname        role  age
0   Alex   Brown     Student   20
1  Chris   Davis  Instructor   31
2   Emma   Green     Student   22
3   John    King       Admin   27
4   Lucy  Miller       Admin   24
5   Nick  Oliver   Professor   45
6   Paul   Quinn   Assistant   19

In [20]:
salary_data = pd.read_csv('Salaries.csv')

In [21]:
salary_data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,AA,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,AB,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,AC,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,AD,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,AE,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [22]:
salary_data.JobTitle.unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC',
       'DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)',
       'ASSISTANT DEPUTY CHIEF II', 'BATTALION CHIEF, (FIRE DEPARTMENT)',
       'DEPUTY DIRECTOR OF INVESTMENTS',
       'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'EXECUTIVE CONTRACT EMPLOYEE', 'DEPARTMENT HEAD V',
       'COMMANDER III, (POLICE DEPARTMENT)',
       'CAPTAIN, EMERGENCYCY MEDICAL SERVICES',
       'ASSISTANT MEDICAL EXAMINER', 'CAPTAIN, FIRE SUPPRESSION',
       'CHIEF OF POLICE', 'DEPUTY CHIEF III (POLICE DEPARTMENT)',
       'INSPECTOR III, (POLICE DEPARTMENT)',
       'ELECTRONIC MAINTENANCE TECHNICIAN',
       'ADMINISTRATOR, SFGH MEDICAL CENTER',
       'LIEUTENANT III (POLICE DEPARTMENT)', 'FIREFIGHTER',
       'NURSING SUPERVISOR PSYCHIATRIC', 'MAYOR',
       'LIEUTENANT, FIRE DEPARTMENT', 'INCIDENT SUPPORT SPECIALIST',
       'ANESTHETIST', 'DISTRICT ATTORNEY',
       'ELECTRICAL TRANSIT MECHANIC, ASSISTANT SUPERVISOR',
       'PORT DIRECTOR',
       'LIEUTENANT, BUREAU OF FIRE PREVENTION AND PUBLIC S',
       'SENIOR PHYSICIAN SPECIALIST', 'FIRE FIGHTER PARAMEDIC',
       'MANAGER VII', 'TRANSIT SUPERVISOR',
       'INSPECTOR, BUREAU OF FIRE PREVENTION AND PUBLIC SA',
       'MANAGER VIII', 'DEPUTY DIRECTOR II - MUNICIPAL TRANSPORTATION AG',
       'NURSING SUPERVISOR', 'POLICE OFFICER III', "SHERIFF'S LIEUTENANT",
       'DEPUTY DIRECTOR V', 'SUPERVISING PHYSICIAN SPECIALIST',
       'DEPARTMENT HEAD IV', 'FORENSIC TOXICOLOGIST',
       'CONFIDENTIAL CHIEF ATTORNEY II (CIVIL & CRIMINAL)',
       'SERGEANT III (POLICE DEPARTMENT)', 'DEPUTY SHERIFF',
       'NURSE MANAGER', 'ELECTRICAL TRANSIT SYSTEM MECHANIC',
       'CITY ATTORNEY', 'MARINE ENGINEER OF FIRE BOATS',
       'CHIEF ATTORNEY I (CIVIL & CRIMINAL)',
       'CAPTAIN, BUREAU OF FIRE PREVENTION AND PUBLIC SAFE',
       'ELECTRICAL TRANSIT SHOP SUPERVISOR I', 'POLICE OFFICER I',
       'POLICE OFFICER II', 'SERGEANT I (POLICE DEPARTMENT)',
       'SPECIAL ASSISTANT XXII', 'DEPUTY DIRECTOR IV',
       'WIRE ROPE CABLE MAINTENANCE SUPERVISOR', 'PUBLIC DEFENDER',
       'SHERIFF', 'HUMAN RESOURCES DIRECTOR',
       'INVESTIGATOR, BUREAU OF FIRE INVESTIGATION',
       'ASSISTANT CHIEF ATTORNEY II', 'DEPUTY DIRECTOR III', 'PHARMACIST',
       'TRANSIT OPERATIONS SPECIALIST', 'DEPARTMENT HEAD III',
       'CHIEF PROBATION OFFICER, JUVENILE COURT', "SHERIFF'S SERGEANT",
       'ASSISTANT INSPECTOR (POLICE DEPARTMENT)',
       'DIAGNOSTIC IMAGING TECH II', 'DIAGNOSTIC IMAGING TECH III',
       'CHIEF ADULT PROBATION OFFICER', 'MANAGER VI',
       'FIRE SAFETY INSPECTOR II', 'MAINTENANCE MACHINIST',
       'ASSISTANT INSPECTOR III (POLICE DEPARTMENT)',
       'DEPUTY DIRECTOR I - MUNICIPAL TRANSPORTATION AGE',
       'DIRECTOR, EMPLOYEE RELATIONS DIVISION',
       'ASSISTANT CHIEF ATTORNEY I', 'TRAIN CONTROLLER',
       'PHYSICIAN ASSISTANT', 'PHYSICIAN SPECIALIST',
       'AUTOMOTIVE MECHANIC SUPERVISOR I', 'ATTORNEY (CIVIL/CRIMINAL)',
       'SERGEANT II (POLICE DEPARTMENT)', 'ELECTRICIAN',
       'NURSE PRACTITIONER',
       'MECHANICAL SHOP AND EQUIPMENT SUPERINTENDENT',
       'HEAD ATTORNEY, CIVIL AND CRIMINAL'], dtype=object)

In [23]:
def filter_fire(x):
    return "FIRE DEPARTMENT" in x

def filter_police(x):
    return "POLICE DEPARTMENT" in x

In [24]:
salary_data.BasePay > 10000

0      True
1      True
2      True
3      True
4      True
       ...
671    True
672    True
673    True
674    True
675    True
Name: BasePay, Length: 676, dtype: bool

In [25]:
salary_data.JobTitle.apply(filter_fire)

0      False
1      False
2      False
3      False
4       True
       ...
671    False
672    False
673    False
674    False
675    False
Name: JobTitle, Length: 676, dtype: bool

In [26]:
a = salary_data[salary_data.JobTitle.apply(filter_fire)].shape[0]

In [27]:
b = salary_data[salary_data.JobTitle.apply(filter_police)].shape[0]

In [28]:
print(b/a)

1.3181818181818181

In [29]:
mean_police_salary = salary_data[salary_data.JobTitle.apply(filter_police)].BasePay.mean()
print(mean_police_salary)

151947.28689655173

In [30]:
mean_fire_salary = salary_data[salary_data.JobTitle.apply(filter_fire)].BasePay.mean()
print(mean_fire_salary)

144449.87079545454

In [31]:
json_data = [{"Name": "John", "Age": 30, "Address": {"Street": "Main Street", "City": "New York", "State": "NY", "Zip": "10001"}},
{"Name": "Peter", "Age": 35, "Address": {"Street": "2nd Street", "City": "Los Angeles", "State": "CA", "Zip": "90001"}},
{"Name": "Amy", "Age": 20, "Address": {"Street": "1st Street", "City": "Chicago", "State": "IL", "Zip": "60601"}}]

In [32]:
json_file = pd.json_normalize(json_data)

In [33]:
json_file

    Name  Age Address.Street Address.City Address.State Address.Zip
0   John   30    Main Street     New York            NY       10001
1  Peter   35     2nd Street  Los Angeles            CA       90001
2    Amy   20     1st Street      Chicago            IL       60601

In [34]:
with open("json_sample.json", "w") as file:
    json.dump(json_data, file)

In [37]:
unique_jobs = salary_data.JobTitle.nunique()
print(unique_jobs)

93

In [39]:
def get_first_name(x, name = "john"):
    first_name = x.split()[0]
    return first_name.lower() == name.lower()

In [42]:
first_name_john = salary_data[salary_data.EmployeeName.apply(get_first_name, name = 'john')]

In [43]:
first_name_john

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
13,AN,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,NaN,292671.62,292671.62,2011,NaN,San Francisco,NaN
26,BA,JOHN HANLEY,"CAPTAIN, FIRE SUPPRESSION",92080.80,40008.00,133695.76,NaN,265784.56,265784.56,2011,NaN,San Francisco,NaN
33,BH,JOHN TURSI,"INSPECTOR III, (POLICE DEPARTMENT)",104861.39,50227.61,103499.39,NaN,258588.39,258588.39,2011,NaN,San Francisco,NaN
93,DP,JOHN MURPHY,CAPTAIN III (POLICE DEPARTMENT),215914.03,0.00,12293.83,NaN,228207.86,228207.86,2011,NaN,San Francisco,NaN
112,EI,JOHN HALEY JR,DEPUTY DIRECTOR II - MUNICIPAL TRANSPORTATION AG,220115.22,0.00,237.00,NaN,220352.22,220352.22,2011,NaN,San Francisco,NaN
127,EX,JOHN HICKEY,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.63,22432.91,25855.73,NaN,216981.27,216981.27,2011,NaN,San Francisco,NaN
132,FC,JOHN RAHAIM,DEPARTMENT HEAD IV,215799.48,0.00,0.00,NaN,215799.48,215799.48,2011,NaN,San Francisco,NaN
153,FX,JOHN CAVANAUGH,"CAPTAIN, EMERGENCYCY MEDICAL SERVICES",140546.88,54054.41,18236.44,NaN,212837.73,212837.73,2011,NaN,San Francisco,NaN
163,GH,JOHN BRAGAGNOLO,SERGEANT III (POLICE DEPARTMENT),130457.96,6284.61,73334.31,NaN,210076.88,210076.88,2011,NaN,San Francisco,NaN
185,HD,JOHN BROWN,MANAGER VIII,207798.79,0.00,0.00,NaN,207798.79,207798.79,2011,NaN,San Francisco,NaN
214,IG,JOHN FEENEY,CAPTAIN III (POLICE DEPARTMENT),188348.55,5720.22,10173.43,NaN,204242.20,204242.20,2011,NaN,San Francisco,NaN
234,JA,JOHN ROCCO,"LIEUTENANT, FIRE DEPARTMENT",123105.00,56654.78,22564.64,NaN,202324.42,202324.42,2011,NaN,San Francisco,NaN
240,JG,JOHN EHRLICH,CAPTAIN III (POLICE DEPARTMENT),188341.62,1068.45,12211.62,NaN,201621.69,201621.69,2011,NaN,San Francisco,NaN
252,JS,JOHN GOLDBERG,CAPTAIN III (POLICE DEPARTMENT),188341.61,0.00,12119.40,NaN,200461.01,200461.01,2011,NaN,San Francisco,NaN
308,LW,JOHN VAN KOLL,POLICE OFFICER III,112401.07,23572.29,60183.94,NaN,196157.30,196157.30,2011,NaN,San Francisco,NaN
326,MO,JOHN NESTOR,SERGEANT III (POLICE DEPARTMENT),135339.78,16309.92,43704.98,NaN,195354.68,195354.68,2011,NaN,San Francisco,NaN
345,NH,JOHN KOSTA,FIREFIGHTER,105934.69,70312.13,17938.07,NaN,194184.89,194184.89,2011,NaN,San Francisco,NaN
348,NK,JOHN GARRITY,CAPTAIN III (POLICE DEPARTMENT),188341.62,1131.28,4586.65,NaN,194059.55,194059.55,2011,NaN,San Francisco,NaN
359,NV,JOHN MURPHY,"LIEUTENANT, FIRE DEPARTMENT",123104.98,54870.85,15365.22,NaN,193341.05,193341.05,2011,NaN,San Francisco,NaN
366,OC,JOHN LOFTUS,CAPTAIN III (POLICE DEPARTMENT),188341.62,0.00,4609.75,NaN,192951.37,192951.37,2011,NaN,San Francisco,NaN
368,OE,JOHN SANFORD JR,CAPTAIN III (POLICE DEPARTMENT),188341.62,0.00,4586.66,NaN,192928.28,192928.28,2011,NaN,San Francisco,NaN
411,PV,JOHN BUCHANAN JR,DEPARTMENT HEAD III,190248.76,0.00,0.00,NaN,190248.76,190248.76,2011,NaN,San Francisco,NaN
464,RW,JOHN HART,SERGEANT III (POLICE DEPARTMENT),130481.51,18014.24,38960.95,NaN,187456.70,187456.70,2011,NaN,San Francisco,NaN
466,RY,JOHN BARKER,SENIOR PHYSICIAN SPECIALIST,155276.21,0.00,31931.61,NaN,187207.82,187207.82,2011,NaN,San Francisco,NaN
555,VJ,JOHN FLORES,FIREFIGHTER,105934.65,61569.80,16499.67,NaN,184004.12,184004.12,2011,NaN,San Francisco,NaN
570,VY,JOHN CREMEN,"BATTALION CHIEF, (FIRE DEPARTMENT)",147158.86,14702.89,21512.66,NaN,183374.41,183374.41,2011,NaN,San Francisco,NaN
593,WV,JOHN STANFIELD,FIRE FIGHTER PARAMEDIC,122418.29,44409.33,15903.78,NaN,182731.40,182731.40,2011,NaN,San Francisco,NaN
620,XW,JOHN CAGNEY,"INSPECTOR III, (POLICE DEPARTMENT)",130466.56,25980.73,25444.50,NaN,181891.79,181891.79,2011,NaN,San Francisco,NaN
644,YU,JOHN BAKER,MECHANICAL SHOP AND EQUIPMENT SUPERINTENDENT,96616.80,69317.08,15221.78,NaN,181155.66,181155.66,2011,NaN,San Francisco,NaN
655,ZF,JOHN DARMANIN,"INSPECTOR, BUREAU OF FIRE PREVENTION AND PUBLI...",126968.05,369.10,53241.41,NaN,180578.56,180578.56,2011,NaN,San Francisco,NaN

In [44]:
def check_first_name(x):
    first_name = x.split()[0]
    last_name = x.split()[1]
    if len(first_name) > 6: 
        return last_name

In [48]:
last_names = salary_data.EmployeeName.apply(check_first_name).dropna()

In [50]:
last_names

0                FORD
3               CHONG
4             GARDNER
8              MORRIS
11            JACKSON
            ...
661            GAUGER
662               LEE
667               LIU
670          SALVESON
674    AGUILAR-TARCHI
Name: EmployeeName, Length: 215, dtype: object

In [55]:
salary_data.iloc[last_names.index, [1,4]]

                 EmployeeName  OvertimePay
0              NATHANIEL FORD         0.00
3           CHRISTOPHER CHONG     56120.71
4             PATRICK GARDNER      9737.00
8              MICHAEL MORRIS     86362.68
11           PATRICIA JACKSON     87082.62
..                        ...          ...
661        CHRISTOPHER GAUGER         0.00
662              PATRICIA LEE         0.00
667               REBECCA LIU         0.00
670        ELIZABETH SALVESON         0.00
674  ELIZABETH AGUILAR-TARCHI         0.00

[215 rows x 2 columns]

In [57]:
salary_data['last_updated'] = datetime.datetime.now().isoformat()

In [59]:
salary_data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,last_updated
0,AA,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,2023-05-10T15:30:16.160903
1,AB,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,2023-05-10T15:30:16.160903
2,AC,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,2023-05-10T15:30:16.160903
3,AD,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,2023-05-10T15:30:16.160903
4,AE,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,2023-05-10T15:30:16.160903